# SetText

## Description
Procedure SetText sets the content of the referenced text object. The new text is assigned the font, size and style characteristics of the first character of the old text string.

```pascal
PROCEDURE SetText(
				objectHd : HANDLE;
				text     : DYNARRAY[] of CHAR);
```

```python
def vs.SetText(objectHd, text):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectHd|HANDLE|Handle to text object.|
|text|DYNARRAY[] of CHAR|New text string value.|

## Examples
#### VectorScript ####
```pascal
SetText(hText,'A new text string value');
```
Better example:
```pascal
PROCEDURE Example;
{ (c) Petri Sakkinen 1997 or thereabouts }
VAR
theText, theRest :HANDLE;
x, y :REAL;
textstart, moretext :STRING;
BEGIN
theText := FSActLayer;
Message('Point text blocks to be concatenated');
textstart := GetText(theText);
GetPt(x, y);
theRest := PickObject(x, y);
REPEAT
moretext := GetText(theRest);
textstart := Concat(textstart, ' ', moretext);
DelObject(theRest);
GetPt(x, y);
theRest := PickObject(x, y);
UNTIL (theRest = NIL);
SetText(theText, textstart);
ClrMessage;
END;
RUN(Example);
```
#### Python ####
```python

```

```pascal
dateflag := (flag & (GetRField(hobj,kRecName,kStatName) = kStatValYellow))|(NOT(flag) & (GetRField(hobj,kRecName,kStatName) = kStatValRed));
IF dateflag THEN BEGIN
	SetText(hobj,Date(2,0));
	IF flag THEN SetRField(hobj,kRecName,kDateName,Date(2,0)) ELSE SetRField(hobj,kRecName,kPUDateName,Date(2,0));
	END;

BEGIN
	If gDaylightSavingsOn then fDisplayStr := Concat(Num2Str(0, fHour-1), ' : ') ELSE fDisplayStr := Concat(Num2Str(0, fHour), ' : ');
	IF fMinute < 10 THEN fDisplayStr := Concat(fDisplayStr, '0');
	fDisplayStr := Concat(fDisplayStr, Num2Str(0, fMinute));
	SetText(gFrameCounterHan, fDisplayStr);
END;

BEGIN
	SetText (gIssueNoteTextH, description);
```
```python
vs.SetText(objectHd, 'Example')
```

## Version
Availability: from All Versions

## Category
* Objects - Text